
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПараметрыКонфигурацииЗапроса = ygpt_Запросы.НовыеПараметрыКонфигурацииЗапроса();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыКонфигурацииЗапроса);
	
	Модели = ygpt_Запросы.Модели();
	
	Элементы.Модель.СписокВыбора.ЗагрузитьЗначения(Модели);
	
	Модель = ygpt_Запросы.СтандартнаяМодель();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)

	ВыполнитьЗапросНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодключения(Команда)
	
	ОткрытьФорму("ОбщаяФорма.Настройки", , ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьЗапросНаСервере()
	
	ОписаниеЗапроса = ygpt_Запросы.НовоеОписаниеЗапроса();

	ПараметрыКонфигурацииЗапроса = ygpt_Запросы.НовыеПараметрыКонфигурацииЗапроса();
	ЗаполнитьЗначенияСвойств(ПараметрыКонфигурацииЗапроса, ЭтотОбъект);
	
	ОписаниеЗапроса.ТекстЗапроса = ТекстЗапроса;
	ОписаниеЗапроса.КонтекстЗапроса = КонтекстЗапроса;
	
	ТекстОтвета = ygpt_Запросы.ВыполнитьЗапрос(ОписаниеЗапроса);
	
КонецПроцедуры

#КонецОбласти