
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает параметры подключения к сервису,
//	сохраненные в информационной базе.
//	Перед вызовом вызывающий код должен устанавливать привилегированный режим.
//
// Возвращаемое значение:
//	Структура - структура, содержащая параметры подключения
//	См. ПараметрыПодключения().
//
Функция ПрочитатьПараметрыПодключения() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторПодсистемы = ygpt_Интеграция.ИдентификаторПодсистемы();

	ДанныеВБезопасномХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ИдентификаторПодсистемы);
	
	Возврат ДанныеВБезопасномХранилище;

КонецФункции

#КонецОбласти