
#Область ПрограммныйИнтерфейс

// Выполняет запрос.
//
// Параметры:
//  ОписаниеЗапроса	 - Структура - См. НовоеОписаниеЗапроса().
// 
// Возвращаемое значение:
//  Строка - Текст ответа модели.
//
Функция ВыполнитьЗапрос(ОписаниеЗапроса) Экспорт

	Возврат ygpt_Интеграция.ВыполнитьЗапрос(ОписаниеЗапроса);

КонецФункции

Функция Модели() Экспорт
	
	Модели = Новый Массив;
	
	Модели.Добавить(СтандартнаяМодель());
	Модели.Добавить("YandexGPT");
	Модели.Добавить("Краткий пересказ");
	
	Возврат Модели;
	
КонецФункции	

Функция НовыеПараметрыКонфигурацииЗапроса() Экспорт

	Параметры = Новый Структура;
	
	Параметры .Вставить("ПотоковаяПередача", Ложь);
	Параметры .Вставить("Температура", 0.6);
	Параметры .Вставить("МаксимальноеКоличествоТокенов", 2000);
	
	Возврат Параметры;

КонецФункции

Функция НовоеОписаниеЗапроса() Экспорт

	ОписаниеЗапроса = Новый Структура;
	
	ОписаниеЗапроса.Вставить("Модель", СтандартнаяМодель());
	
	ОписаниеЗапроса.Вставить("ПараметрыКонфигурацииЗапроса", НовыеПараметрыКонфигурацииЗапроса());
	
	ОписаниеЗапроса.Вставить("КонтекстЗапроса", "");
	ОписаниеЗапроса.Вставить("ТекстЗапроса", "");
	
	Возврат ОписаниеЗапроса;

КонецФункции

Функция СтандартнаяМодель() Экспорт

	Модель = "YandexGPT Lite";
	
	Возврат Модель;
	
КонецФункции

#КонецОбласти